JakubFranek/ESP32/ESP-ink/nRF24L01p_RX/main/nrf24l01p.c
#include "nrf24l01p.h"
#include <stddef.h> // definitions of NULL, size_t

/* ------------------------------ Macros ------------------------------ */
#ifndef SET_BIT
#define SET_BIT(reg, bit) ((reg) |= (bit))
#endif

#ifndef CLEAR_BIT
#define CLEAR_BIT(reg, bit) ((reg) &= ~(bit))
#endif

#ifndef READ_BIT
#define READ_BIT(reg, bit) ((reg) & (bit))
#endif

#ifndef CLEAR_FIELD
#define CLEAR_FIELD(field, mask) ((field) &= ~(mask))
#endif

#ifndef SET_FIELD
#define SET_FIELD(field, new_val, mask, pos) ((field) |= (((new_val) << (pos)) & (mask)))
#endif

#ifndef READ_FIELD
#define READ_FIELD(field, mask) ((field) & (mask))
#endif

/**
 * Error-checking macro: if `expr` returns anything other than `NRF24L01P_SUCCESS`,
 * this macro returns that return value, exiting the function where this macro was used immediately.
 */
#define NRF24L01P_CHECK_STATUS(expr)     \
	do                                   \
	{                                    \
		Nrf24l01pStatus retval = expr;   \
		if (retval != NRF24L01P_SUCCESS) \
		{                                \
			return retval;               \
		}                                \
	} while (0)

/**
 * Error-checking macro: if `expr` is `NULL`, this macro returns `NRF24L01P_POINTER_NULL`,
 * exiting the function where this macro was used immediately.
 */
#define NRF24L01P_CHECK_NULL(expr)         \
	do                                     \
	{                                      \
		if (expr == NULL)                  \
		{                                  \
			return NRF24L01P_POINTER_NULL; \
		}                                  \
	} while (0)

/* ------------------------------ Module variables ------------------------------ */

Nrf24l01p8bitRegRstVals reg_rst_vals_8bit[] = {
	{NRF24L01P_REG_CONFIG, NRF24L01P_REG_CONFIG_RSTVAL},
	{NRF24L01P_REG_EN_AA, NRF24L01P_REG_EN_AA_RSTVAL},
	{NRF24L01P_REG_EN_RXADDR, NRF24L01P_REG_EN_RXADDR_RSTVAL},
	{NRF24L01P_REG_SETUP_AW, NRF24L01P_REG_SETUP_AW_RSTVAL},
	{NRF24L01P_REG_SETUP_RETR, NRF24L01P_REG_SETUP_RETR_RSTVAL},
	{NRF24L01P_REG_RF_CH, NRF24L01P_REG_RF_CH_RSTVAL},
	{NRF24L01P_REG_RF_SETUP, NRF24L01P_REG_RF_SETUP_RSTVAL},
	{NRF24L01P_REG_STATUS, NRF24L01P_REG_STATUS_RSTVAL},
	{NRF24L01P_REG_RX_ADDR_P2, NRF24L01P_REG_RX_ADDR_P2_RSTVAL},
	{NRF24L01P_REG_RX_ADDR_P3, NRF24L01P_REG_RX_ADDR_P3_RSTVAL},
	{NRF24L01P_REG_RX_ADDR_P4, NRF24L01P_REG_RX_ADDR_P4_RSTVAL},
	{NRF24L01P_REG_RX_ADDR_P5, NRF24L01P_REG_RX_ADDR_P5_RSTVAL},
	{NRF24L01P_REG_RX_PW_P0, NRF24L01P_REG_RX_PW_P0_RSTVAL},
	{NRF24L01P_REG_RX_PW_P1, NRF24L01P_REG_RX_PW_P1_RSTVAL},
	{NRF24L01P_REG_RX_PW_P2, NRF24L01P_REG_RX_PW_P2_RSTVAL},
	{NRF24L01P_REG_RX_PW_P3, NRF24L01P_REG_RX_PW_P3_RSTVAL},
	{NRF24L01P_REG_RX_PW_P4, NRF24L01P_REG_RX_PW_P4_RSTVAL},
	{NRF24L01P_REG_RX_PW_P5, NRF24L01P_REG_RX_PW_P5_RSTVAL},
	{NRF24L01P_REG_FIFO_STATUS, NRF24L01P_REG_FIFO_STATUS_RSTVAL},
	{NRF24L01P_REG_DYNPD, NRF24L01P_REG_DYNPD_RSTVAL},
	{NRF24L01P_REG_FEATURE, NRF24L01P_REG_FEATURE_RSTVAL}};

Nrf24l01p40bitRegRstVals reg_rst_vals_40bit[] = {
	{NRF24L01P_REG_RX_ADDR_P0, NRF24L01P_REG_RX_ADDR_P0_RSTVAL},
	{NRF24L01P_REG_RX_ADDR_P1, NRF24L01P_REG_RX_ADDR_P1_RSTVAL},
	{NRF24L01P_REG_TX_ADDR, NRF24L01P_REG_TX_ADDR_RSTVAL},
};

/* ------------------------------ Static functions ------------------------------ */

/**
 * @brief Reads a single byte from a register in the nRF24L01+ chip.
 *
 * @param[in]  device  A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 * @param[in]  address The address of the register to read from.
 * @param[out] value   The address of a `uint8_t` to store the read value in.
 *
 * @retval `NRF24L01P_SUCCESS`		SPI transfer succeeded.
 * @retval `NRF24L01P_SPI_ERROR`	SPI transfer failed.
 */
static Nrf24l01pStatus read_register(Nrf24l01pDevice *device, uint8_t address, uint8_t *value)
{
	uint8_t command = NRF24L01P_CMD_R_REGISTER | address;
	uint8_t tx_data[2] = {command, 0x00};
	uint8_t rx_data[2];
	int8_t spi_status;

	device->interface.set_cs(0);
	spi_status = device->interface.spi_tx_rx(tx_data, rx_data, 2);
	device->interface.set_cs(1);

	if (spi_status != 0)
		return NRF24L01P_SPI_ERROR;

	*value = rx_data[1];

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Reads multiple bytes from a register in the nRF24L01+ chip.
 *
 * @param[in]  device  A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 * @param[in]  address The address of the register to read from.
 * @param[out] value   The address of a `uint64_t` to store the read value in.
 * @param[in]  length  The number of bytes to read from the register.
 *
 * @retval `NRF24L01P_SUCCESS`		SPI transfer succeeded.
 * @retval `NRF24L01P_SPI_ERROR`	SPI transfer failed.
 */
static Nrf24l01pStatus read_register_multibyte(Nrf24l01pDevice *device, uint8_t address, uint64_t *value, uint8_t length)
{
	uint8_t rx_data[length + 1];
	uint8_t tx_data[length + 1];
	int8_t spi_status;

	tx_data[0] = NRF24L01P_CMD_R_REGISTER | address;

	device->interface.set_cs(0);
	spi_status = device->interface.spi_tx_rx(tx_data, rx_data, length + 1);
	device->interface.set_cs(1);

	if (spi_status != 0)
		return NRF24L01P_SPI_ERROR;

	*value = 0; // reset output value to zeros
	for (int i = 0; i < length; i++)
		*value |= ((uint64_t)rx_data[i + 1] << (i * 8));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Writes a single byte to a register in the nRF24L01+ chip.
 *
 * @param[in] device  A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 * @param[in] address The address of the register to write to.
 * @param[in] payload The byte value to write to the register.
 *
 * @retval `NRF24L01P_SUCCESS`   SPI transfer succeeded.
 * @retval `NRF24L01P_SPI_ERROR` SPI transfer failed.
 */
static Nrf24l01pStatus write_register(Nrf24l01pDevice *device, uint8_t address, uint8_t payload)
{
	uint8_t tx_data[2] = {NRF24L01P_CMD_W_REGISTER | address, payload};
	uint8_t rx_data[2];
	int8_t spi_status;

	device->interface.set_cs(0);
	spi_status = device->interface.spi_tx_rx(tx_data, rx_data, 2);
	device->interface.set_cs(1);

