JakubFranek/ESP32/ESP-ink/nRF24L01p_RX/main/nrf24l01p.c
	if (spi_status != 0)
		return NRF24L01P_SPI_ERROR;
	return NRF24L01P_SUCCESS;
}

/**
 * @brief Writes multiple bytes to a register in the nRF24L01+ chip.
 *
 * @param[in] device   A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 * @param[in] address  The address of the register to write to.
 * @param[in] payload  The value to write to the register, as a 64-bit unsigned integer.
 * @param[in] length   The number of bytes to write from the payload.
 *
 * @retval `NRF24L01P_SUCCESS`   SPI transfer succeeded.
 * @retval `NRF24L01P_SPI_ERROR` SPI transfer failed.
 */
static Nrf24l01pStatus write_register_multibyte(Nrf24l01pDevice *device, uint8_t address, uint64_t payload, uint8_t length)
{
	uint8_t tx_data[length + 1];
	uint8_t rx_data[length + 1];
	int8_t spi_status;

	tx_data[0] = NRF24L01P_CMD_W_REGISTER | address;
	for (int i = 0; i < length; i++)
		tx_data[i + 1] = (uint8_t)((payload >> (i * 8)) & 0xFF);

	device->interface.set_cs(0);
	spi_status = device->interface.spi_tx_rx(tx_data, rx_data, length + 1);
	device->interface.set_cs(1);

	if (spi_status != 0)
		return NRF24L01P_SPI_ERROR;
	return NRF24L01P_SUCCESS;
}

/**
 * @brief Sends a single-byte command to the nRF24L01+ chip and reads the resulting status byte.
 *
 * @param[in] device   A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 * @param[in] command  The command byte to send to the chip.
 * @param[out] status  The status byte returned by the chip.
 *
 * @retval `NRF24L01P_SUCCESS`   SPI transfer succeeded.
 * @retval `NRF24L01P_SPI_ERROR` SPI transfer failed.
 */
static Nrf24l01pStatus send_command(Nrf24l01pDevice *device, uint8_t command, uint8_t *status)
{
	int8_t spi_status;

	device->interface.set_cs(0);
	spi_status = device->interface.spi_tx_rx(&command, status, 1);
	device->interface.set_cs(1);

	if (spi_status != 0)
		return NRF24L01P_SPI_ERROR;
	return NRF24L01P_SUCCESS;
}

/* ------------------------------ High-level API ------------------------------ */

/**
 * @brief Initializes the nRF24L01+ chip for TX (transmit) operation.
 *
 * This function must be called before calling any other nRF24L01+ functions.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`		Initialization succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed.
 * @retval `NRF24L01P_POINTER_NULL` `device` is `NULL`.
 */
Nrf24l01pStatus nrf24l01p_init_ptx(Nrf24l01pDevice *device)
{
	NRF24L01P_CHECK_NULL(device);

	NRF24L01P_CHECK_STATUS(nrf24l01p_reset(device));
	NRF24L01P_CHECK_STATUS(nrf24l01p_init_general_config(device));

	// TX config
	NRF24L01P_CHECK_STATUS(nrf24l01p_set_tx_output_power(device));
	NRF24L01P_CHECK_STATUS(nrf24l01p_set_tx_auto_retransmit_count(device));
	NRF24L01P_CHECK_STATUS(nrf24l01p_set_tx_auto_retransmit_delay(device));
	NRF24L01P_CHECK_STATUS(nrf24l01p_set_tx_addr(device));
	NRF24L01P_CHECK_STATUS(nrf24l01p_set_ptx_mode(device));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Initializes the nRF24L01+ chip for RX (receive) operation.
 *
 * This function must be called before calling any other nRF24L01+ functions.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS` 		Initialization succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed.
 * @retval `NRF24L01P_POINTER_NULL` `device` is `NULL`.
 */
Nrf24l01pStatus nrf24l01p_init_prx(Nrf24l01pDevice *device)
{
	NRF24L01P_CHECK_NULL(device);

	NRF24L01P_CHECK_STATUS(nrf24l01p_reset(device));
	NRF24L01P_CHECK_STATUS(nrf24l01p_init_general_config(device));

	NRF24L01P_CHECK_STATUS(nrf24l01p_set_rx_pipes(device));
	NRF24L01P_CHECK_STATUS(nrf24l01p_set_rx_auto_ack_pipes(device));
	NRF24L01P_CHECK_STATUS(nrf24l01p_set_rx_addresses(device));
	NRF24L01P_CHECK_STATUS(nrf24l01p_set_rx_payload_length(device));
	NRF24L01P_CHECK_STATUS(nrf24l01p_set_prx_mode(device));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Receives data from the nRF24L01+ chip and stores it in the provided buffer.
 *
 * This function reads the RX FIFO of the nRF24L01+ chip.
 *
 * @param[in]  device     A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 * @param[out] rx_payload A pointer to a buffer where the received data will be stored.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while reading from RX FIFO.
 * @retval `NRF24L01P_POINTER_NULL` Either `device` or `rx_payload` is `NULL`.
 */
Nrf24l01pStatus nrf24l01p_rx_receive(Nrf24l01pDevice *device, uint8_t *rx_payload)
{
	NRF24L01P_CHECK_NULL(device);
	NRF24L01P_CHECK_NULL(rx_payload);

	NRF24L01P_CHECK_STATUS(nrf24l01p_read_rx_fifo(device, rx_payload));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Transmits data from the nRF24L01+ chip.
 *
 * This function writes the given data to the TX FIFO of the nRF24L01+ chip.
 *
 * @param[in] device     A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 * @param[in] tx_payload A pointer to the data to be transmitted.
 * @param[in] num_bytes  The number of bytes to transmit.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while writing to TX FIFO.
 * @retval `NRF24L01P_POINTER_NULL` Either `device` or `tx_payload` is `NULL`.
 */
Nrf24l01pStatus nrf24l01p_tx_transmit(Nrf24l01pDevice *device, uint8_t *tx_payload, uint8_t num_bytes)
{
	NRF24L01P_CHECK_NULL(device);
	NRF24L01P_CHECK_NULL(tx_payload);

	NRF24L01P_CHECK_STATUS(nrf24l01p_write_tx_fifo(device, tx_payload, num_bytes));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Reads the IRQ flags of the nRF24L01+ chip and clears them.
 *
 * The `Nrf24l01pIrq` struct is filled with the values of the IRQ flags at the time of the call.
 *
 * @param[in]  device     	A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 * @param[out] irq_sources 	A pointer to a `Nrf24l01pIrq` struct that will be filled with the IRQ flag values.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while reading from STATUS register.
 * @retval `NRF24L01P_POINTER_NULL` Either `device` or `irq_sources` is `NULL`.
 */
Nrf24l01pStatus nrf24l01p_get_and_clear_irq_flags(Nrf24l01pDevice *device, Nrf24l01pIrq *irq_sources)
{
	NRF24L01P_CHECK_NULL(device);
	NRF24L01P_CHECK_NULL(irq_sources);

	uint8_t status;

	NRF24L01P_CHECK_STATUS(nrf24l01p_get_status(device, &status));
	NRF24L01P_CHECK_STATUS(nrf24l01p_clear_status_flags(device,
														NRF24L01P_REG_STATUS_MAX_RT |
															NRF24L01P_REG_STATUS_TX_DS |
															NRF24L01P_REG_STATUS_RX_DR));

	irq_sources->rx_dr = READ_BIT(status, NRF24L01P_REG_STATUS_RX_DR);
	irq_sources->tx_ds = READ_BIT(status, NRF24L01P_REG_STATUS_TX_DS);
	irq_sources->max_rt = READ_BIT(status, NRF24L01P_REG_STATUS_MAX_RT);

