JakubFranek/ESP32/ESP-ink/nRF24L01p_RX/main/nrf24l01p.c
	return NRF24L01P_SUCCESS;
}

/**
 * @brief Resets the nRF24L01+ chip to its default state.
 *
 * This function will reset the pins and registers of the nRF24L01+ chip to their default values and
 * reset the FIFOs.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while writing to registers.
 * @retval `NRF24L01P_POINTER_NULL` `device` is `NULL`.
 */
Nrf24l01pStatus nrf24l01p_reset(Nrf24l01pDevice *device)
{
	NRF24L01P_CHECK_NULL(device);

	// Reset pins
	device->interface.set_cs(1);

	// Reset registers
	for (size_t i = 0; i < sizeof(reg_rst_vals_8bit) / sizeof(reg_rst_vals_8bit[0]); i++)
		NRF24L01P_CHECK_STATUS(write_register(device, reg_rst_vals_8bit[i].address, reg_rst_vals_8bit[i].value));

	for (size_t i = 0; i < sizeof(reg_rst_vals_40bit) / sizeof(reg_rst_vals_40bit[0]); i++)
		NRF24L01P_CHECK_STATUS(write_register_multibyte(device, reg_rst_vals_40bit[i].address, reg_rst_vals_40bit[i].value, 40 / 8));

	// Reset FIFOs
	NRF24L01P_CHECK_STATUS(nrf24l01p_flush_rx_fifo(device));
	NRF24L01P_CHECK_STATUS(nrf24l01p_flush_tx_fifo(device));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Sets the nRF24L01+ chip to RX mode.
 *
 * This function sets the `PRIM_RX` bit in the `CONFIG` register, which sets the nRF24L01+ chip to RX mode.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while writing to the CONFIG register.
 * @retval `NRF24L01P_POINTER_NULL` `device` is `NULL`.
 */
Nrf24l01pStatus nrf24l01p_set_prx_mode(Nrf24l01pDevice *device)
{
	NRF24L01P_CHECK_NULL(device);

	uint8_t config_reg;
	NRF24L01P_CHECK_STATUS(read_register(device, NRF24L01P_REG_CONFIG, &config_reg));
	SET_BIT(config_reg, NRF24L01P_REG_CONFIG_PRIM_RX);

	NRF24L01P_CHECK_STATUS(write_register(device, NRF24L01P_REG_CONFIG, config_reg));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Sets the nRF24L01+ chip to TX mode.
 *
 * This function clears the `PRIM_RX` bit in the `CONFIG` register, which sets the nRF24L01+ chip to TX mode.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while writing to the CONFIG register.
 * @retval `NRF24L01P_POINTER_NULL` `device` is `NULL`.
 */
Nrf24l01pStatus nrf24l01p_set_ptx_mode(Nrf24l01pDevice *device)
{
	NRF24L01P_CHECK_NULL(device);

	uint8_t config_reg;
	NRF24L01P_CHECK_STATUS(read_register(device, NRF24L01P_REG_CONFIG, &config_reg));
	CLEAR_BIT(config_reg, NRF24L01P_REG_CONFIG_PRIM_RX);

	NRF24L01P_CHECK_STATUS(write_register(device, NRF24L01P_REG_CONFIG, config_reg));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Sets the RX addresses of the nRF24L01+ chip.
 *
 * This function sets the RX addresses in the nRF24L01+ chip according to the values in the `Nrf24l01pRxConfig` struct.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`   		The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 		SPI transfer failed while writing to the RX address registers.
 * @retval `NRF24L01P_POINTER_NULL` 	`device` is `NULL`.
 */
Nrf24l01pStatus nrf24l01p_set_rx_addresses(Nrf24l01pDevice *device)
{
	NRF24L01P_CHECK_NULL(device);

	uint64_t address;
	uint8_t address_width;

	for (int i = 0; i < 6; i++)
	{
		switch (i)
		{
		case 0:
			address = device->rx_config.address_p0;
			break;
		case 1:
			address = device->rx_config.address_p1;
			break;
		case 2:
			address = (uint64_t)device->rx_config.address_p2;
			break;
		case 3:
			address = (uint64_t)device->rx_config.address_p3;
			break;
		case 4:
			address = (uint64_t)device->rx_config.address_p4;
			break;
		default:
			address = (uint64_t)device->rx_config.address_p5;
		}

		if (i < 2)
			address_width = 5;
		else
			address_width = 1;

		NRF24L01P_CHECK_STATUS(write_register_multibyte(device, NRF24L01P_REG_RX_ADDR_P0 + i, address, address_width));
	}

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Sets the TX address of the nRF24L01+ chip.
 *
 * This function sets the TX address in the nRF24L01+ chip according to the value in the `Nrf24l01pTxConfig` struct.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while writing to the TX address register.
 * @retval `NRF24L01P_POINTER_NULL` `device` is `NULL`.
 */
Nrf24l01pStatus nrf24l01p_set_tx_addr(Nrf24l01pDevice *device)
{
	NRF24L01P_CHECK_NULL(device);

	NRF24L01P_CHECK_STATUS(write_register_multibyte(device, NRF24L01P_REG_TX_ADDR, device->tx_config.address, device->config.address_width));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Reads the RX address of a specified pipe from the nRF24L01+ chip.
 *
 * This function retrieves the RX address for a given pipe index (0 to 5) and stores it
 * in the provided `address` pointer. For pipe indices 0 and 1, the full address is read,
 * while for indices 2 to 5, only a single byte is read.
 *
 * @param[in]  device  A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 * @param[in]  index   The pipe index (0 to 5) to read the RX address from.
 * @param[out] address A pointer to a `uint64_t` where the read RX address will be stored.
 *
 * @retval `NRF24L01P_SUCCESS`      	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR`    	SPI transfer failed while reading the address.
 * @retval `NRF24L01P_POINTER_NULL` 	Either `device` or `address` is `NULL`.
 * @retval `NRF24L01P_INVALID_VALUE` 	The provided pipe index is out of range (not between 0 and 5).
 */
Nrf24l01pStatus nrf24l01p_read_rx_addr(Nrf24l01pDevice *device, uint8_t index, uint64_t *address) // index must be integer from 0 to 5
{
	NRF24L01P_CHECK_NULL(device);
	NRF24L01P_CHECK_NULL(address);

