JakubFranek/ESP32/ESP-ink/nRF24L01p_RX/main/nrf24l01p.c
	if (index > 5)
		return NRF24L01P_INVALID_VALUE;

	if (index == 0 || index == 1)
		NRF24L01P_CHECK_STATUS(read_register_multibyte(device, NRF24L01P_REG_RX_ADDR_P0 + index, address, device->config.address_width));
	else
	{
		uint8_t address_byte;
		NRF24L01P_CHECK_STATUS(read_register(device, NRF24L01P_REG_RX_ADDR_P0 + index, &address_byte));
		*address = (uint64_t)address_byte;
	}

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Reads the TX address from the nRF24L01+ chip.
 *
 * This function retrieves the TX address from the nRF24L01+ chip and stores it
 * in the provided `address` pointer. The address is read from the `TX_ADDR` register.
 *
 * @param[in]  device  A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 * @param[out] address A pointer to a `uint64_t` where the read TX address will be stored.
 *
 * @retval `NRF24L01P_SUCCESS`      	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR`    	SPI transfer failed while reading the TX address.
 * @retval `NRF24L01P_POINTER_NULL` 	Either `device` or `address` is `NULL`.
 */
Nrf24l01pStatus nrf24l01p_read_tx_addr(Nrf24l01pDevice *device, uint64_t *address)
{
	NRF24L01P_CHECK_NULL(device);
	NRF24L01P_CHECK_NULL(address);

	NRF24L01P_CHECK_STATUS(read_register_multibyte(device, NRF24L01P_REG_TX_ADDR, address, device->config.address_width));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Powers up the nRF24L01+ chip.
 *
 * This function powers up the nRF24L01+ chip by setting the `PWR_UP` bit in the `CONFIG` register.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while writing to the CONFIG register.
 * @retval `NRF24L01P_POINTER_NULL` `device` is `NULL`.
 */
Nrf24l01pStatus nrf24l01p_power_up(Nrf24l01pDevice *device)
{
	NRF24L01P_CHECK_NULL(device);

	uint8_t config_reg;
	NRF24L01P_CHECK_STATUS(read_register(device, NRF24L01P_REG_CONFIG, &config_reg));
	SET_BIT(config_reg, NRF24L01P_REG_CONFIG_PWR_UP);

	NRF24L01P_CHECK_STATUS(write_register(device, NRF24L01P_REG_CONFIG, config_reg));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Powers down the nRF24L01+ chip.
 *
 * This function powers down the nRF24L01+ chip by clearing the `PWR_UP` bit in the `CONFIG` register.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while writing to the CONFIG register.
 * @retval `NRF24L01P_POINTER_NULL` `device` is `NULL`.
 */
Nrf24l01pStatus nrf24l01p_power_down(Nrf24l01pDevice *device)
{
	NRF24L01P_CHECK_NULL(device);

	uint8_t config_reg;
	NRF24L01P_CHECK_STATUS(read_register(device, NRF24L01P_REG_CONFIG, &config_reg));
	CLEAR_BIT(config_reg, NRF24L01P_REG_CONFIG_PWR_UP);

	NRF24L01P_CHECK_STATUS(write_register(device, NRF24L01P_REG_CONFIG, config_reg));

	return NRF24L01P_SUCCESS;
}

/* ------------------------------ Low-level API ------------------------------ */

/**
 * @brief Reads the status register of the nRF24L01+ chip.
 *
 * This function reads the value of the `STATUS` register from the nRF24L01+ chip and stores it
 * in the provided `status` pointer.
 *
 * @param[in]  device 	A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 * @param[out] status 	A pointer to a `uint8_t` where the read status register value will be stored.
 *
 * @retval `NRF24L01P_SUCCESS`      	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR`    	SPI transfer failed while reading the STATUS register.
 */
Nrf24l01pStatus nrf24l01p_get_status(Nrf24l01pDevice *device, uint8_t *status)
{
	return send_command(device, NRF24L01P_CMD_NOP, status);
}

/**
 * @brief Reads the status register of the nRF24L01+ chip and clears the IRQ flags.
 *
 * This function reads the value of the `STATUS` register from the nRF24L01+ chip and stores it
 * in the provided `status` pointer. It also clears the IRQ flags by writing the value back to
 * the register.
 *
 * @param[in]  device 	A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 * @param[out] status 	A pointer to a `uint8_t` where the read status register value will be stored.
 *
 * @retval `NRF24L01P_SUCCESS`      	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR`    	SPI transfer failed while reading/writing the STATUS register.
 */
Nrf24l01pStatus nrf24l01p_get_status_and_clear_IRQ_flags(Nrf24l01pDevice *device, uint8_t *status)
{
	int8_t spi_status;
	uint8_t command = NRF24L01P_CMD_W_REGISTER | NRF24L01P_REG_STATUS;

	device->interface.set_cs(0);
	spi_status = device->interface.spi_tx_rx(&command, status, 1);
	if (spi_status != 0)
	{
		device->interface.set_cs(1);
		return NRF24L01P_SPI_ERROR;
	}
	// Following line takes advantage of the fact that active flag is 1, and writing 1 to it clears it
	NRF24L01P_CHECK_STATUS(device->interface.spi_tx(status, 1));
	device->interface.set_cs(1);

	if (spi_status != 0)
		return NRF24L01P_SPI_ERROR;
	return NRF24L01P_SUCCESS;
}

/**
 * @brief Retrieves the FIFO status of the nRF24L01+ chip.
 *
 * This function reads the `FIFO_STATUS` register of the nRF24L01+ chip and stores
 * its value in the provided `fifo_status` pointer.
 *
 * @param[in]  device      A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 * @param[out] fifo_status A pointer to a `uint8_t` where the FIFO status register value will be stored.
 *
 * @retval `NRF24L01P_SUCCESS`      	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR`    	SPI transfer failed while reading the `FIFO_STATUS` register.
 */
Nrf24l01pStatus nrf24l01p_get_fifo_status(Nrf24l01pDevice *device, uint8_t *fifo_status)
{
	NRF24L01P_CHECK_STATUS(read_register(device, NRF24L01P_REG_FIFO_STATUS, fifo_status));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Flushes the RX FIFO of the nRF24L01+ chip.
 *
 * This function clears the RX FIFO of the nRF24L01+ chip.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`      	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR`    	SPI transfer failed while flushing the RX FIFO.
 */
Nrf24l01pStatus nrf24l01p_flush_rx_fifo(Nrf24l01pDevice *device)
{
	uint8_t status;
	NRF24L01P_CHECK_STATUS(send_command(device, NRF24L01P_CMD_FLUSH_RX, &status));

