JakubFranek/ESP32/ESP-ink/nRF24L01p_RX/main/nrf24l01p.c
	return NRF24L01P_SUCCESS;
}

/**
 * @brief Flushes the TX FIFO of the nRF24L01+ chip.
 *
 * This function clears the TX FIFO of the nRF24L01+ chip by sending the FLUSH_TX command.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`      	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR`    	SPI transfer failed while flushing the TX FIFO.
 */
Nrf24l01pStatus nrf24l01p_flush_tx_fifo(Nrf24l01pDevice *device)
{
	uint8_t status;
	NRF24L01P_CHECK_STATUS(send_command(device, NRF24L01P_CMD_FLUSH_TX, &status));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Reads the RX FIFO of the nRF24L01+ chip and retrieves the received payload.
 *
 * This function checks the status register to determine which pipe contains the received data
 * and reads the payload from the RX FIFO into the provided buffer. If the RX FIFO is empty,
 * it returns an error. It also handles invalid pipe numbers.
 *
 * @param[in]  device     A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 * @param[out] rx_payload A pointer to a buffer where the received data will be stored.
 *
 * @retval `NRF24L01P_SUCCESS`          The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR`        SPI transfer failed while reading from RX FIFO.
 * @retval `NRF24L01P_INVALID_VALUE`    The pipe number is invalid (greater than 5).
 * @retval `NRF24L01P_INVALID_OPERATION` The RX FIFO is empty.
 */
Nrf24l01pStatus nrf24l01p_read_rx_fifo(Nrf24l01pDevice *device, uint8_t *rx_payload)
{
	uint8_t status;
	int8_t spi_status;

	NRF24L01P_CHECK_STATUS(send_command(device, NRF24L01P_CMD_NOP, &status));

	uint8_t pipe = READ_FIELD(status, NRF24L01P_REG_STATUS_RX_P_NO_MASK);
	if (pipe == 0b110)
		return NRF24L01P_INVALID_VALUE; // there is no pipe '6' (0-5 only)
	if (pipe == 0b111)
		return NRF24L01P_INVALID_OPERATION; // RX FIFO is empty

	uint8_t length = device->rx_config.data_length[pipe];
	uint8_t tx_data[length + 1];
	uint8_t rx_data[length + 1];
	tx_data[0] = NRF24L01P_CMD_R_RX_PAYLOAD; // the rest of the data does not matter
	for (int i = 0; i < length; i++)
		tx_data[i + 1] = 0xFF;

	device->interface.set_cs(0);
	spi_status = device->interface.spi_tx_rx(tx_data, rx_data, length + 1);
	device->interface.set_cs(1);

	if (spi_status != 0)
		return NRF24L01P_SPI_ERROR;

	for (int i = 0; i < length; i++)
		rx_payload[i] = rx_data[i + 1];

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Writes data to the TX FIFO of the nRF24L01+ chip.
 *
 * This function writes the given data to the TX FIFO of the nRF24L01+ chip.
 *
 * @param[in] device     A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 * @param[in] tx_payload A pointer to the data to be transmitted.
 * @param[in] length     The number of bytes to transmit.
 *
 * @retval `NRF24L01P_SUCCESS`    SPI transfer succeeded.
 * @retval `NRF24L01P_SPI_ERROR`  SPI transfer failed while writing to TX FIFO.
 */
Nrf24l01pStatus nrf24l01p_write_tx_fifo(Nrf24l01pDevice *device, uint8_t *tx_payload, uint8_t length)
{
	uint8_t rx_data[length + 1];
	uint8_t tx_data[length + 1];
	int8_t spi_status;

	tx_data[0] = NRF24L01P_CMD_W_TX_PAYLOAD;
	for (int i = 0; i < length; i++)
		tx_data[i + 1] = tx_payload[i];

	device->interface.set_cs(0);
	spi_status = device->interface.spi_tx_rx(tx_data, rx_data, length + 1);
	device->interface.set_cs(1);

	if (spi_status != 0)
		return NRF24L01P_SPI_ERROR;

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Sets the RX payload length of the nRF24L01+ chip.
 *
 * This function sets the RX payload length for each of the 6 pipes in the nRF24L01+ chip according to the values
 * in the `Nrf24l01pRxConfig` struct.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while writing to the RX payload length registers.
 * @retval `NRF24L01P_INVALID_VALUE` One of the RX payload lengths is invalid (0 or greater than 32).
 */
Nrf24l01pStatus nrf24l01p_set_rx_payload_length(Nrf24l01pDevice *device)
{
	for (int i = 0; i < 6; i++)
	{
		if (device->rx_config.data_length[i] > 32 || device->rx_config.data_length[i] == 0)
			return NRF24L01P_INVALID_VALUE;
		NRF24L01P_CHECK_STATUS(write_register(device, NRF24L01P_REG_RX_PW_P0 + i, device->rx_config.data_length[i]));
	}

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Clears the given flags in the `STATUS` register of the nRF24L01+ chip.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 * @param[in] flags The flags to clear in the `STATUS` register.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while reading/writing the STATUS register.
 */
Nrf24l01pStatus nrf24l01p_clear_status_flags(Nrf24l01pDevice *device, uint8_t flags)
{
	uint8_t status = flags;

	NRF24L01P_CHECK_STATUS(write_register(device, NRF24L01P_REG_STATUS, status));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Sets the CRC length for the nRF24L01+ chip.
 *
 * This function configures the CRC length of the nRF24L01+ by updating the `CRCO` bit
 * in the `CONFIG` register based on the `crc_length` specified in the device's configuration.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while reading/writing the CONFIG register.
 */
Nrf24l01pStatus nrf24l01p_set_crc_length(Nrf24l01pDevice *device)
{

	uint8_t config_reg;
	NRF24L01P_CHECK_STATUS(read_register(device, NRF24L01P_REG_CONFIG, &config_reg));

	CLEAR_BIT(config_reg, NRF24L01P_REG_CONFIG_CRCO);
	config_reg |= device->config.crc_length; // enum values already reflect physical encoding

	NRF24L01P_CHECK_STATUS(write_register(device, NRF24L01P_REG_CONFIG, config_reg));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Sets the address width for the nRF24L01+ chip.
 *
 * This function sets the address width to the specified value in the
 * `Nrf24l01pConfig` struct. The address width must be between 3 and 5 bytes.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while writing to the SETUP_AW register.
 * @retval `NRF24L01P_INVALID_VALUE` The address width is out of range (less than 3 or greater than 5).
 */
Nrf24l01pStatus nrf24l01p_set_address_width(Nrf24l01pDevice *device)
{
	if (device->config.address_width < 3 || device->config.address_width > 5)
		return NRF24L01P_INVALID_VALUE;

	NRF24L01P_CHECK_STATUS(write_register(device, NRF24L01P_REG_SETUP_AW, device->config.address_width - 2));

