JakubFranek/ESP32/ESP-ink/nRF24L01p_RX/main/nrf24l01p.c
	return NRF24L01P_SUCCESS;
}

/**
 * @brief Sets the auto retransmit count for the nRF24L01+ chip.
 *
 * This function configures the number of automatic retransmissions
 * for failed transmissions. The value is set in the `SETUP_RETR` register.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while reading/writing the SETUP_RETR register.
 * @retval `NRF24L01P_INVALID_VALUE` The auto retransmit count exceeds the maximum allowed value (15).
 */
Nrf24l01pStatus nrf24l01p_set_tx_auto_retransmit_count(Nrf24l01pDevice *device)
{
	if (device->tx_config.auto_retransmit_count > 15)
		return NRF24L01P_INVALID_VALUE;

	uint8_t setup_retr;

	NRF24L01P_CHECK_STATUS(read_register(device, NRF24L01P_REG_SETUP_RETR, &setup_retr));

	CLEAR_FIELD(setup_retr, NRF24L01P_REG_SETUP_RETR_ARC_MASK);
	SET_FIELD(setup_retr, device->tx_config.auto_retransmit_count, NRF24L01P_REG_SETUP_RETR_ARC_MASK, NRF24L01P_REG_SETUP_RETR_ARC_POS);

	NRF24L01P_CHECK_STATUS(write_register(device, NRF24L01P_REG_SETUP_RETR, setup_retr));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Sets the auto retransmit delay for the nRF24L01+ chip.
 *
 * This function configures the auto retransmit delay in 250 us increments
 * from 250 us (1) to 4000 us (16). The value is set in the `SETUP_RETR` register.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`   		The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 		SPI transfer failed while reading/writing the SETUP_RETR register.
 * @retval `NRF24L01P_INVALID_VALUE` 	The auto retransmit delay exceeds the maximum allowed value (16).
 */
Nrf24l01pStatus nrf24l01p_set_tx_auto_retransmit_delay(Nrf24l01pDevice *device)
{
	if (device->tx_config.auto_retransmit_delay_250us < 1 || device->tx_config.auto_retransmit_delay_250us > 16)
		return NRF24L01P_INVALID_VALUE;

	uint8_t setup_retr;
	uint8_t code = (device->tx_config.auto_retransmit_delay_250us - 1);

	NRF24L01P_CHECK_STATUS(read_register(device, NRF24L01P_REG_SETUP_RETR, &setup_retr));

	CLEAR_FIELD(setup_retr, NRF24L01P_REG_SETUP_RETR_ARD_MASK);
	SET_FIELD(setup_retr, code, NRF24L01P_REG_SETUP_RETR_ARD_MASK, NRF24L01P_REG_SETUP_RETR_ARD_POS);

	NRF24L01P_CHECK_STATUS(write_register(device, NRF24L01P_REG_SETUP_RETR, setup_retr));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Enables/disables the RX pipes of the nRF24L01+ chip.
 *
 * This function writes the `enable_pipes` member of the `Nrf24l01pRxConfig` struct
 * to the `EN_RXADDR` register, which enables/disables the corresponding RX pipes.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while writing to the EN_RXADDR register.
 */
Nrf24l01pStatus nrf24l01p_set_rx_pipes(Nrf24l01pDevice *device)
{
	uint8_t enable_pipes = (device->rx_config.enable_pipes & 0b00111111); // force bits 7 and 6 to zero

	NRF24L01P_CHECK_STATUS(write_register(device, NRF24L01P_REG_EN_RXADDR, enable_pipes));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Sets the auto ACK status of the RX pipes of the nRF24L01+ chip.
 *
 * This function writes the `auto_ack_pipes` member of the `Nrf24l01pRxConfig` struct
 * to the `EN_AA` register, which enables/disables the automatic acknowledgement of
 * received packets for the corresponding RX pipes.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while writing to the EN_AA register.
 */
Nrf24l01pStatus nrf24l01p_set_rx_auto_ack_pipes(Nrf24l01pDevice *device)
{
	uint8_t en_aa = (device->rx_config.auto_ack_pipes & 0b00111111); // force bits 7 and 6 to zero

	NRF24L01P_CHECK_STATUS(write_register(device, NRF24L01P_REG_EN_AA, en_aa));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Sets the RF channel of the nRF24L01+ chip.
 *
 * This function writes the `channel_MHz` member of the `Nrf24l01pConfig` struct
 * to the `RF_CH` register, which sets the RF channel of the nRF24L01+ chip.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while writing to the RF_CH register.
 * @retval `NRF24L01P_INVALID_VALUE` The RF channel is outside the valid range (2400 to 2525 [MHz]).
 */
Nrf24l01pStatus nrf24l01p_set_rf_channel(Nrf24l01pDevice *device)
{
	if (device->config.channel_MHz < 2400 || device->config.channel_MHz > 2525)
		return NRF24L01P_INVALID_VALUE;

	uint8_t rf_ch = device->config.channel_MHz - 2400;

	NRF24L01P_CHECK_STATUS(write_register(device, NRF24L01P_REG_RF_CH, rf_ch));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Sets the TX output power of the nRF24L01+ chip.
 *
 * This function configures the transmission output power of the nRF24L01+ chip.
 * The value is set in the `RF_SETUP` register.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while writing to the `RF_SETUP` register.
 */
Nrf24l01pStatus nrf24l01p_set_tx_output_power(Nrf24l01pDevice *device)
{
	uint8_t rf_setup;

	NRF24L01P_CHECK_STATUS(read_register(device, NRF24L01P_REG_RF_SETUP, &rf_setup));
	CLEAR_FIELD(rf_setup, NRF24L01P_REG_RF_SETUP_RF_PWR_MASK);
	rf_setup |= device->tx_config.output_power; // enum values already reflect physical encoding

	NRF24L01P_CHECK_STATUS(write_register(device, NRF24L01P_REG_RF_SETUP, rf_setup));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Sets the data rate of the nRF24L01+ chip.
 *
 * This function configures the data rate of the nRF24L01+ chip.
 * The value is set in the `RF_SETUP` register.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while writing to the `RF_SETUP` register.
 */
Nrf24l01pStatus nrf24l01p_set_rf_data_rate(Nrf24l01pDevice *device)
{
	uint8_t rf_setup;

	NRF24L01P_CHECK_STATUS(read_register(device, NRF24L01P_REG_RF_SETUP, &rf_setup));
	rf_setup &= ~(NRF24L01P_REG_RF_SETUP_RF_DR_HIGH | NRF24L01P_REG_RF_SETUP_RF_DR_LOW);
	rf_setup |= device->config.data_rate; // enum values already reflect physical encoding

	NRF24L01P_CHECK_STATUS(write_register(device, NRF24L01P_REG_RF_SETUP, rf_setup));

