JakubFranek/ESP32/ESP-ink/nRF24L01p_RX/main/nrf24l01p.c
	return NRF24L01P_SUCCESS;
}

/**
 * @brief Configures the interrupt mask for the nRF24L01+ chip.
 *
 * This function updates the mask for interrupts in the `CONFIG` register based on the
 * `enable_irq_max_rt`, `enable_irq_tx_ds`, and `enable_irq_rx_dr` fields of the `Nrf24l01pConfig`
 * struct.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while reading/writing the CONFIG register.
 */
Nrf24l01pStatus nrf24l01p_set_irq_masks(Nrf24l01pDevice *device)
{
	uint8_t config_reg;

	NRF24L01P_CHECK_STATUS(read_register(device, NRF24L01P_REG_CONFIG, &config_reg));
	config_reg &= ~(NRF24L01P_REG_CONFIG_MASK_MAX_RT | NRF24L01P_REG_CONFIG_MASK_TX_DS | NRF24L01P_REG_CONFIG_MASK_RX_DR);
	config_reg |= (device->config.enable_irq_max_rt ? 0 : NRF24L01P_REG_CONFIG_MASK_MAX_RT) |
				  (device->config.enable_irq_tx_ds ? 0 : NRF24L01P_REG_CONFIG_MASK_TX_DS) |
				  (device->config.enable_irq_rx_dr ? 0 : NRF24L01P_REG_CONFIG_MASK_RX_DR);

	NRF24L01P_CHECK_STATUS(write_register(device, NRF24L01P_REG_CONFIG, config_reg));

	return NRF24L01P_SUCCESS;
}

/**
 * @brief Initializes the nRF24L01+ chip's general configuration.
 *
 * This function configures the RF channel, address width, RF data rate, CRC length, and interrupt masks
 * based on the fields in the `Nrf24l01pConfig` struct.
 *
 * @param[in] device A pointer to the `Nrf24l01pDevice` struct representing the nRF24L01+ chip.
 *
 * @retval `NRF24L01P_SUCCESS`   	The operation succeeded.
 * @retval `NRF24L01P_SPI_ERROR` 	SPI transfer failed while writing to one of the configuration registers.
 */
Nrf24l01pStatus nrf24l01p_init_general_config(Nrf24l01pDevice *device)
{
	NRF24L01P_CHECK_STATUS(nrf24l01p_set_rf_channel(device));
	NRF24L01P_CHECK_STATUS(nrf24l01p_set_address_width(device));
	NRF24L01P_CHECK_STATUS(nrf24l01p_set_rf_data_rate(device));
	NRF24L01P_CHECK_STATUS(nrf24l01p_set_crc_length(device));
	NRF24L01P_CHECK_STATUS(nrf24l01p_set_irq_masks(device));

	return NRF24L01P_SUCCESS;
}
